Model: "sequential_32"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_254 (Conv2D)          (None, 318, 318, 8)       224       
_________________________________________________________________
max_pooling2d_177 (MaxPoolin (None, 159, 159, 8)       0         
_________________________________________________________________
conv2d_255 (Conv2D)          (None, 157, 157, 16)      1168      
_________________________________________________________________
max_pooling2d_178 (MaxPoolin (None, 78, 78, 16)        0         
_________________________________________________________________
conv2d_256 (Conv2D)          (None, 76, 76, 32)        4640      
_________________________________________________________________
max_pooling2d_179 (MaxPoolin (None, 38, 38, 32)        0         
_________________________________________________________________
conv2d_257 (Conv2D)          (None, 36, 36, 64)        18496     
_________________________________________________________________
max_pooling2d_180 (MaxPoolin (None, 18, 18, 64)        0         
_________________________________________________________________
conv2d_258 (Conv2D)          (None, 16, 16, 128)       73856     
_________________________________________________________________
max_pooling2d_181 (MaxPoolin (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_259 (Conv2D)          (None, 6, 6, 256)         295168    
_________________________________________________________________
max_pooling2d_182 (MaxPoolin (None, 3, 3, 256)         0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 2304)              0         
_________________________________________________________________
dense_97 (Dense)             (None, 512)               1180160   
_________________________________________________________________
dense_98 (Dense)             (None, 256)               131328    
_________________________________________________________________
dense_99 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_100 (Dense)            (None, 1)                 129       
=================================================================
Total params: 1,738,065
Trainable params: 1,738,065
Non-trainable params: 0
_________________________________________________________________
None